<?php
// +-----------------------------------------------------------------------+
// | Piwigo - a PHP based photo gallery                                    |
// +-----------------------------------------------------------------------+
// | Copyright(C) 2008-2012 Piwigo Team                  http://piwigo.org |
// | Copyright(C) 2003-2008 PhpWebGallery Team    http://phpwebgallery.net |
// | Copyright(C) 2002-2003 Pierrick LE GALL   http://le-gall.net/pierrick |
// +-----------------------------------------------------------------------+
// | This program is free software; you can redistribute it and/or modify  |
// | it under the terms of the GNU General Public License as published by  |
// | the Free Software Foundation                                          |
// |                                                                       |
// | This program is distributed in the hope that it will be useful, but   |
// | WITHOUT ANY WARRANTY; without even the implied warranty of            |
// | MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the GNU      |
// | General Public License for more details.                              |
// |                                                                       |
// | You should have received a copy of the GNU General Public License     |
// | along with this program; if not, write to the Free Software           |
// | Foundation, Inc., 59 Temple Place - Suite 330, Boston, MA 02111-1307, |
// | USA.                                                                  |
// +-----------------------------------------------------------------------+
$lang['Audit_Btn'] = 'Аудит';
$lang['error_config_guest'] = 'ПОМИЛКА : ім\'я облікового запису гостя FluxBB неправильне!';
$lang['error_config_admin1'] = 'ПОМИЛКА : Ім\'я користувача адміністратора Piwigo неправильне!';
$lang['save_config'] = 'Налаштування збережені';
$lang['New_Link'] = 'Пов\'язані облікові записи:';
$lang['Prefix'] = 'Префікс таблиць FluxBB:';
$lang['Error_Synchro_Mail'] = 'на адресу електронної пошти';
$lang['Error_Synchro_Pswd'] = 'на паролі';
$lang['Guest'] = 'Ім\'я користувача "Гостя" на FluxBB.';
$lang['Link_Dead'] = 'Видалення мертвих посилань';
$lang['Link_Del'] = 'Видалити посилання:';
$lang['Link_Dup'] = 'Видалення дублікатів';
$lang['Sync_Btn'] = 'Синхронізація';
$lang['Sync_OK'] = 'Синхронізація OK<br><br>';
$lang['Sync_User'] = 'Обліковий запис синхронізації';
$lang['%d email addresses already exist: %s'] = '%d адрес електронної пошти вже існують: %s';
$lang['%d email addresses rejected: %s'] = '%d адрес електронної пошти відкинуто: %s';
$lang['%d registrations on error: %s'] = '%d реєстрацій з помилкою: %s';
$lang['%d users registered'] = '%d користувачів зареєстровано';
$lang['About_Bridge_Title'] = 'Про міст Register_FluxBB / UAM';
$lang['About_Reg_Title'] = 'Про реєстрацію користувачів на форумі FluxBB';
$lang['About_Reg_Title_d'] = 'Корисні поради щодо кращої інтеграції';
$lang['Add_User'] = 'Додавання облікового запису у FluxBB';
$lang['Add_User2pwg'] = 'Додавання облікового запису у Piwigo';
$lang['Advise_Check_Dup'] = '<b>НЕМОЖЛИВО продовжити синхронізацію якщо у Вас є дублікати облікових записів у Piwigo або FluxBB. Спробуйте, будь ласка, ще раз.</b><br/><br/>';
$lang['Advise_FluxBB_Dup'] = '<b>УВАГА! Ви повинні виконати наведені зміни у FluxBB перед тим, як продовжити.<br/> Скористайтесь іконками для видалення користучаів з FluxBB та вирішіть проблему.</b>';
$lang['Advise_PWG_Dup'] = '<b>УВАГА! Ви повинні виконати наведені зміни у Piwigo перед тим, як продовжити.</br> Скористайтесь менеджером облікових записів Piwigo для вирішення проблеми.</b>';
$lang['Audit_FluxBB2PWG'] = '<b>Аудит існуючих облікових записів у FluxBB та відсутніх у Piwigo</b>';
$lang['Audit_FluxBB_Dup'] = '<b>Аудит таблиці облікових записів FluxBB</b>';
$lang['Audit_Link_Bad'] = '<b>Аудит поламаних записів між Piwigo та FluxBB</b>';
$lang['Audit_Link_Break'] = '<b>Аудит поламаних записів, котрі можна відновити між Piwigo та FluxBB</b>';
$lang['Audit_OK'] = 'Аудит завершено успішно<br/><br/>';
$lang['Audit_PWG2FluxBB'] = '<b>Аудит існуючих облікових записів у Piwigo та відстуніх у FluxBB</b>';
$lang['Audit_PWG_Dup'] = '<b>Аудит таблиці облікових записів FluxBB</b>';
$lang['Del_Pt'] = 'Видалення тем і повідомлень користувача з форуму, якщо його профіль видалено з Piwigo';
$lang['Sync_Title_d'] = 'Використати для синхронізації аккаунтів';
$lang['Instruction_Title'] = 'Інструкції (важливо спочатку прочитати)';
$lang['Config_Title2'] = 'Розширене налаштування плагіна';
$lang['Confirm_true'] = '--&gt; Не питати підтвердження';
$lang['Del_Pt_true'] = '--&gt; Видалити все';
$lang['Audit_Synchro_OK'] = '<b>: Данні сінхронізовані ОК</b>';
$lang['Config_Title_d'] = 'Налаштування плагіна';
$lang['Config_Title'] = 'Налаштування плагіна';
$lang['Please change your password at your first connexion on the gallery'] = 'Будьласка, змініть ваш пароль при першому підключенні до галереї для закінчення синхронізації даних';
$lang['RegFluxBB_Email_or_Username_already_exist'] = 'Синхронізація з FluxBB до Piwigo зупинена: ел.пошта чи ім\'я користувача вже існую у таблиці користувачів Piwigo.';
$lang['RegFluxBB_Password_Reset_Msg'] = 'Будьласка, оновіть ваш пароль для синхронізації з форумом. Після цього ви зможете заходити до форуму з обліковоим записом від галереї.';
$lang['Sync_Check_Dup'] = '<b>Аналіз таблиць користувачів для контролю дублікатів</b>';
$lang['Sync_DataUser'] = '<b>Аналіз паролей та адресів ел.пошти поміж обліковими записами Piwigo та FluxBB</b>';
$lang['Sync_FluxBB2PWG'] = '<b>Аналіз облікових записів, що існують у FluxBB, але не існують у Piwigo</b>';
$lang['Sync_Link_Bad'] = '<b>Аналіз поганих співвідношень облікових записів між Piwigo та FluxBB</b>';
$lang['Sync_Link_Break'] = '<b>Аналіз посилань, що можуть бути виправлені, між обліковими записами у Piwigo та FluxBB</b>';
$lang['Sync_PWG2FluxBB'] = '<b>Аналіз облікових записів, що існують у Piwigo, але не існують у FluxBB</b>';
$lang['error_config_admin2'] = 'ПОМИЛКА: Ім\'я адміністратора FluxBB відрізняється від Piwigo! Перевірте налаштування вашого форуму FluxBB та змініть ім\'я облікового запису "Administrator" на такеж як у Piwigo';
$lang['Sync_Title'] = 'Синхронізуванти облікові записи з Piwigo до FluxBB';
$lang['Instruction_Title_d'] = 'Інструкції та важлива інформація';
$lang['FluxBB_Title'] = 'Версія Register_FluxBB: ';
$lang['Config_Title1'] = 'Налаштування мосту поміж FluxBB та Piwigo';
$lang['Bridge_UAM_true'] = ' --> Включити міст Register_FluxBB / UAM';
$lang['Bridge_UAM_false'] = ' --> Відключити міст Register_FluxBB / UAM (за замовчанням)';
$lang['Audit_Synchro'] = '<b>Аудит синхронізації паролей та адресів ел.пошти поміж обліковими записами Piwigo та FluxBB</b>';
$lang['About_Bridge_Title_d'] = 'Інструкція про міст між Register_FluxBB та UserAdvManager плагінами';
$lang['UAM_Bridge_advice'] = 'Плагін UserAdvManager дозволяє змусити нових реєструючихся користувачів підтвердити їх реєстрацію, перш ніж дозволити їм доступ до всієї галереї. Спільне використання цього плагіну з Register_FluxBB можете зробити те ж саме на пов\'язаному форумі: Нові зареєстровані користувачі не зможуть писати повідомлення поки не підтвердять їх регістрацію в галереї. <br/>
Ось загальна процедура користування:
<br/>
- В панелі адміністрування вашого форуму FluxBB, встановіть щонайменше дві групи користувачів (наприклад: "validated" та "no_validated").<br/>
- Дайте першій групі ("validated") права доступу до форуму (які бажаєте) та встановіть її групою за замовчанням.<br/>
- Видаліть у другій групі ("no_validated") усі права доступу на вашому форумі (члени цієї групи можуть лише читати публічні повідомлення).<br/>
- Знайдіть ідентифікатор ID другої групи "no_validated".<br/>
- Введіть цей ідентифікатор у плагіні Register_FluxBB, активуйте міст та збережіть налаштування.
<br/>
<b class="mod"><u>Важливі зауваження:</u></b>
<br/>
Якщо ви вже використовували попередні версії Register_FluxBB, облікові записи Piwigo пов\'язані між вашою галереєю та форумом FluxBB не отримають ефекту від мосту. Тільки нові зареєстровані користувачі відчують активацію мосту.<b><u>Функція пересинхронізації облікових записів буде пустою.</u></b><br/>
Аналогічно, якщо ви ніколи не використовували плагін Register_FluxBB, процес міграції облікових записів Piwigo з вашої галереї до форуму FluxBB буде ігнорувати підтверджених та непідтверджених облікових записів на початку міграції.';
$lang['Sync_Text'] = '  <div class="warning">Синхронізація це масова операція що може видалити користувачів форуму! Запустіть аудит щоб керувати кожним випадком.</div><br/><br/>
  
  Нагадування:<br/>
  Паролі синхронізованих  вручну облікових записів (через аудит або загальної синхронізації) з Piwigo в FluxBB не відновлюються. Кожен користувач повинен змінити свій пароль при наступному вході до галереї (він буде автоматично перенаправлений на сторінку його профілю) щоб синхронізація була ефективною, і він міг підключитися до форуму.<br/><br/>
  Поки це не можливо синхронізувати існуючих користувачів на форумі FluxBB до галереї Piwigo. Ось чому запропонований аудит видаляє облікові записи FluxBB. Ви можете залишити ці несинхронізовані облікові записи (вони зможуть підключатися лише до форуму) в очікуванні наступної версії плагіну, який буде робити таку синхронізацію.<br/><br/>';
$lang['FluxBB_Group'] = 'Тут ви можете задати ID (format: integer) <b>групи користувачів FluxBB</b> у якій будуть розташовані неперевірені користувачі якщо вони не підтвердили свою регістрацію у галереї. Ця група користувачів спочатку повинна бути створена у FluxBB. Для ефективності, ця група повинна не мати жодних дозволів у форумі (дивись розділ "Інструкції" для детальної информації)';
$lang['FluxBB_Admin'] = 'Ім\'я користувача облікового запису Piwigo "Webmaster". <b style="color: red">Ім\'я облікового запису FluxBB "Administrator" повинні співпадати!</b>';
$lang['To synchronize your forum access with the gallery you have been registered at %s!'] = 'Щоб синхронізувати ваш доступ до форуму з галереєю, ви повинні бути зареєстровані в %s!';
$lang['Error_Synchro'] = '<b>Погана синхронізація облікового запису:</b> ';
$lang['Error_PWG_Dup'] = '<b>Помилка в таблиці облікових записів Piwigo, тут дублікати:</b> ';
$lang['Error_PWG2FluxBB'] = '<b>Обліковий запис Piwigo відсутній у FluxBB:</b> ';
$lang['Error_Link_Dup'] = '<b>Помилка в таблиці зв\'язків, тут дублікати:</b> ';
$lang['Error_FluxBB_Dup'] = '<b>Помилка в таблиці облікових записів FluxBB, тут дублікати:</b>';
$lang['Error_Link_Del'] = '<b>Помилка в таблиці зв\'язків поміж двома користувачами:</b> ';
$lang['Error_Link_Dead'] = '<b>Помилка в таблиці зв\'язків, мертві посилання:</b> ';
$lang['Error_Link_Break'] = '<b>Зламаний зв\'язок поміж обліковими записами Piwigo та FluxBB:</b> ';
$lang['Error_FluxBB2PWG'] = '<b>Обліковий запис FluxBB відсутній у Piwigo:</b> ';
$lang['Details_true'] = ' --&gt; Максимальний рівень - Відображаються всі деталі про результати синхронізації та міграції';
$lang['Details_false'] = ' --&gt; Мінімальний рівень - Відображаються тільки головні результати синхронізації та міграції';
$lang['Details'] = 'Рівень деталізації у звітах операцій синхронізації і міграції';
$lang['Del_User'] = 'Видалення облікового запису в FluxBB:';
$lang['Del_Pt_false'] = ' --&gt; Не удаляти теми та повідомлення з форуму';
$lang['Confirm_false'] = ' --&gt; Підтвердження потрібно перед любою дією при аудиті';
$lang['Confirm'] = 'Підтвердження коригувальних дій при аудиті';
$lang['Config_Disclaimer'] = 'Перевірте налаштування вашої інсталяції FluxBB і виправте їх, якщо необхідно.<br/>Змініть, якщо необхідно, налаштування плагіну як ви хочете.';
$lang['Bridge_UAM'] = 'Перевірка доступу до форуму, використовуючи плагін UserAdvManager (UAM): Тут ви активуєте міст між двома плагінами, який дозволяє обмежити доступ до вашого форумі FluxBB, якщо користувач не підтвердив його або її реєстрацію в галереї (пов\'язана функція UAM повинна бути активною)';